app/views/pokeballs/_form2.html.erb

SELECT "pokemons".* FROM "pokemons"
---

<h3>  Pokemon List Select:</h3> <%=f.collection_select :pokemon_id, Pokemon.all, :id, :name %>