app/views/pokeballs/_form.html.erb

SELECT  "pokemons".* FROM "pokemons" ORDER BY "pokemons"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 3]]
---
    <ul class="move_sprite">
    <% Pokemon.starters.each do |starter|%>