app/controllers/application_controller.rb

    def setup_authorizations
        @logged_in = logged_in?
        @logged_in_trainer = Trainer.find(current_trainer_id) if logged_in?
---
SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]