app/controllers/badges_controller.rb

INSERT INTO "badges" ("trainer_id", "gymleader_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["trainer_id", 1], ["gymleader_id", 3], ["created_at", "2020-02-13 22:46:17.804240"], ["updated_at", "2020-02-13 22:46:17.804240"]]
---
    def create
        unless logged_in?
            flash[:notification] = "Please Log in first, unknown trainer!"
            return redirect_to new_login_path
        end


        if @logged_in_trainer.can_battle
            @badge = Badge.create(trainer_id: current_trainer_id, gymleader_id: params[:gymleader_id])