app/controllers/gymleaders_controller.rb

    def index
        if request.path != gymleaders_path
            redirect_to gymleaders_path
        end
        @gymleaders = Gymleader.includes(:badges).all
---
SELECT "badges".* FROM "badges" WHERE "badges"."gymleader_id" IN (?, ?, ?, ?, ?, ?, ?, ?)  [["gymleader_id", 1], ["gymleader_id", 2], ["gymleader_id", 3], ["gymleader_id", 4], ["gymleader_id", 5], ["gymleader_id", 6], ["gymleader_id", 7], ["gymleader_id", 8]]
SELECT "gymleaders".* FROM "gymleaders"

    def show
        @gymleader = Gymleader.find(params[:id])
---
SELECT  "gymleaders".* FROM "gymleaders" WHERE "gymleaders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]