app/controllers/login_controller.rb

SELECT  "trainers".* FROM "trainers" WHERE "trainers"."username" = ? LIMIT ?  [["username", "kirbypooh"], ["LIMIT", 1]]
---
    def create
        @trainer = Trainer.find_by(username: params[:username])