app/controllers/pokeballs_controller.rb

    def create
        unless logged_in?
            flash[:notification] = "Please Log in first, unknown trainer!"
            return redirect_to new_login_path
        end

        if @can_catch_pokemon
            @pokeball = Pokeball.create(trainer_id: current_trainer_id, pokemon_id: params[:pokeball][:pokemon_id])
---
INSERT INTO "pokeballs" ("pokemon_id", "trainer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["pokemon_id", 4], ["trainer_id", 1], ["created_at", "2020-02-14 13:51:41.136131"], ["updated_at", "2020-02-14 13:51:41.136131"]]

    def destroy
        @pokeball = Pokeball.find(params[:id])
        @pokeball.destroy
---
SELECT  "pokeballs".* FROM "pokeballs" WHERE "pokeballs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "pokeballs" WHERE "pokeballs"."id" = ?  [["id", 5]]