app/controllers/trainers_controller.rb

INSERT INTO "trainers" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
    def create
        @trainer = Trainer.create(trainer_params)