app/controllers/welcome_controller.rb

    def index
        @trainers = Trainer.all
---
SELECT "trainers".* FROM "trainers"