app/models/pokemon.rb

SELECT  "pokemons".* FROM "pokemons" ORDER BY "pokemons"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 3]]
---
    def self.starters
        starters = [Pokemon.all[24], Pokemon.all[132], Pokemon.first, Pokemon.fourth, Pokemon.all[6]]