app/models/trainer.rb

    def total_badges
        0 + self.badges.count
---
SELECT COUNT(*) FROM "badges" WHERE "badges"."trainer_id" = ?  [["trainer_id", 1]]

    def total_pokemons
        0 + self.pokeballs.count
---
SELECT COUNT(*) FROM "pokeballs" WHERE "pokeballs"."trainer_id" = ?  [["trainer_id", 1]]